package cn.qumiandan.common.exception;

import cn.qumiandan.common.interfaces.IGenericEnum;
import lombok.Getter;

/**
 * 基础异常枚举
 * @author W
 *  
 */
@Getter
public enum GwErrorCode implements IGenericEnum {
	
	//********************************成功0开头******************************************/
	/** 成功*/
	GW0000("GW0000", "成功"),
	/** 登录成功*/
	GW0001("GW0001", "登录成功"),
	/** 微信授权成功,等待用户注册*/
	GW0002("GW0002", "微信授权成功,等待用户注册"),
	
	//*******************************业务异常1开头**************************************/
	/** 业务异常*/
	GW1000("GW1000", "业务异常"),
	/** 提交参数异常*/
	GW1001("GW1001", "参数错误"),
	/** 不支持当前请求方法*/
	GW1002("GW1002", "不支持当前请求方法"),
	/** 权限验证不合法*/
	GW1003("GW1003", "您没没操作权限"),
	/** token过期*/
	GW1004("GW1004", "token过期"),
	//*****************************第三方错误8开头*************************************/
	/** 微信通过code授权获取到错误信息*/
	GW8001("GW8001", "微信通过code授权获取错误信息"),
	/** 微信通过access_token授权获取错误信息*/
	GW8002("GW8002", "微信通过access_token授权获取错误信息"),
	
	
	/** 短信发送异常*/
	GW8101("GW8101", "短信发送异常"),
	//********************************系统级错误9开头*********************************
	/** 数据库服务异常 */
	GW9001("GW9001", "shiro登录异常"),
	/** 数据库服务异常 */
	GW9002("GW9002", "数据库服务异常"),
	/** Redis服务器异常*/
	GW9003("GW9003", "Redis服务器异常"),
	/** 系统异常*/
	GW9999("GW9999", "系统异常"),
	;
	
	private String code;
	private String msg;
	
	private GwErrorCode(String code, String msg) {
		this.code = code;
		this.msg = msg;
	}
}
